ProService/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.ФирмаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

ProService/src/InformationRegisters/КомлектующиеНоменклатуры/КомлектующиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомлектующиеНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ProService/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗаполнитьРодительскиеЭлементы(Комплектующая)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомлектующиеНоменклатуры.Номенклатура КАК Номенклатура,
		|	КомлектующиеНоменклатуры.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.КомлектующиеНоменклатуры КАК КомлектующиеНоменклатуры
		|ГДЕ
		|	КомлектующиеНоменклатуры.Комплектующая = &Комплектующая";
	
	Запрос.УстановитьПараметр("Комплектующая", Комплектующая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("ВидОборудования");
	ТЗ.Колонки.Добавить("Коэффициент");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаРЭ = ТЗ.Добавить();
		СтрокаРЭ.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаРЭ.ВидОборудования = ВыборкаДетальныеЗаписи.Номенклатура.ВидОборудования;
		СтрокаРЭ.Коэффициент = 1 / ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	РодительскиеЭлементы.Загрузить(ТЗ);	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьРодительскиеЭлементы(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РодительскиеЭлементыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Номенклатура);
КонецПроцедуры
